posts/foss-droid.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>FOSS : On Droid</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/">Home</a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a>

</p>
</div>
<div id="content">
<header>
<h1 class="title">FOSS : On Droid</h1>
</header>
<div id="outline-container-orgbb14a83" class="outline-2">
<h2 id="orgbb14a83">Code is Source&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fossdroid">fossdroid</span>&#xa0;<span class="android">android</span></span></h2>
<div class="outline-text-2" id="text-orgbb14a83">
<p>
As we know, Android is widely popular OS for many phone. But these days its all filled with junks and bloated apps, these are to say so called <b>&ldquo;Popular Android Apps&rdquo;</b> or <b>&ldquo;Trending Apps&rdquo;</b>. The reason simply would be &ldquo;everyone in my circle uses it&rdquo; or &ldquo;I use it because <span class="underline">they</span> use it&rdquo;.
</p>

<p>
But surely you are not giving yourself some privacy or <b>space</b> that you need for your own <b>personal phone</b>.
I&rsquo;m talking about using Free/Libre and Open Source (FOSS) Apps. Free doesn&rsquo;t mean by price, Free means <b>Freedom</b>. Freedom that comes with :
</p>
<ul class="org-ul">
<li>No Trackers.</li>
<li>No Ads.</li>
<li>Minimal permission.</li>
<li>Has customization to users need.</li>
<li>No Restrictions.</li>
</ul>

<p>
These can be achieved in this modern time, by Discovering and using FOSS Apps, the best place being <a href="https://f-droid.org">F-droid</a>  or <a href="https://libreddit.kavin.rocks/r/fossdroid">r/fossdroid</a>.
</p>

<p>
There are pretty much all apps under FOSS area for every purpose, they are good looking with <b>Modern UI</b>, <b>Lots of Customizations</b> and <b>friendly with Battery</b>.
</p>

<p>
I happened to search for book and novel reader and found very good apps there, like QuickNovel.
There is a Manga reader and lots more for every purpose.
</p>

<p>
I exclusively use every apps from F-droid, because they are great.
You should also use it, as you might find something interesting and surely, gets Surprised; and say in your head, <b><i>Gosh I should have known this before</i></b>.
</p>

<hr>

<p>
Some of the cool apps I use everyday :
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class</th>
<th scope="col" class="org-left">Apps</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Launcher</td>
<td class="org-left">Kvæsitso (<a href="https://apt.izzysoft.de/fdroid/index/apk/de.mm20.launcher2.release">izzydroid</a>, <a href="https://github.com/MM2-0/Kvaesitso">git</a>)</td>
</tr>

<tr>
<td class="org-left">F-droid Client</td>
<td class="org-left">Neo Store (<a href="https://f-droid.org/en/packages/com.machiav3lli.fdroid/">fdroid</a>, <a href="https://github.com/NeoApplications/Neo-Store">git</a>)</td>
</tr>

<tr>
<td class="org-left">Browser</td>
<td class="org-left">Mull (<a href="https://f-droid.org/en/packages/us.spotco.fennec_dos/">fdroid</a>, <a href="https://gitlab.com/divested-mobile/mull-fenix">git</a>)</td>
</tr>

<tr>
<td class="org-left">Rss Reader</td>
<td class="org-left">Read You (<a href="https://f-droid.org/en/packages/me.ash.reader/">fdroid</a>, <a href="https://github.com/Ashinch/ReadYou">git</a>)</td>
</tr>

<tr>
<td class="org-left">YouTube</td>
<td class="org-left">LibreTube (<a href="https://f-droid.org/en/packages/com.github.libretube/">fdroid</a>, <a href="https://github.com/libre-tube/LibreTube">git</a>)</td>
</tr>

<tr>
<td class="org-left">PDF/Ebook Reader</td>
<td class="org-left">Librera Reader (<a href="https://f-droid.org/en/packages/com.foobnix.pro.pdf.reader/">fdroid</a>, <a href="https://github.com/foobnix/LibreraReader">git</a>)</td>
</tr>

<tr>
<td class="org-left">Manga Reader</td>
<td class="org-left">Tachiyomi (<a href="https://f-droid.org/en/packages/eu.kanade.tachiyomi/">fdroid</a>, <a href="https://github.com/tachiyomiorg/tachiyomi">git</a>)</td>
</tr>

<tr>
<td class="org-left">Password Manager</td>
<td class="org-left">KeePassDX (<a href="https://f-droid.org/en/packages/com.kunzisoft.keepass.libre/">fdroid</a>, <a href="https://github.com/Kunzisoft/KeePassDX">git</a>)</td>
</tr>

<tr>
<td class="org-left">Novel Reader</td>
<td class="org-left">QuickNovel (<a href="https://apt.izzysoft.de/fdroid/index/apk/com.lagradost.quicknovel">izzydroid</a>, <a href="https://github.com/LagradOst/QuickNovel">git</a>)</td>
</tr>

<tr>
<td class="org-left">Keyboard</td>
<td class="org-left">Unexpected Keyboard (<a href="https://f-droid.org/en/packages/juloo.keyboard2/">fdroid</a>, <a href="https://github.com/Julow/Unexpected-Keyboard">git</a>)</td>
</tr>

<tr>
<td class="org-left">Media Player</td>
<td class="org-left">VLC (<a href="https://f-droid.org/en/packages/org.videolan.vlc/">fdroid</a>, <a href="https://code.videolan.org/videolan/vlc-android">git</a>)</td>
</tr>

<tr>
<td class="org-left">Gallery + Calendar (many more)</td>
<td class="org-left">Simple Tools Suite (<a href="https://search.f-droid.org/?lang=en&amp;q=simple+tools">fdroid</a>, <a href="https://github.com/SimpleMobileTools">git</a>, <a href="https://simplemobiletools.com">site</a>)</td>
</tr>

<tr>
<td class="org-left">Note Taking</td>
<td class="org-left">Orgzly (<a href="https://f-droid.org/en/packages/com.orgzly/">fdroid</a>, <a href="https://github.com/orgzly/orgzly-android">git</a>)</td>
</tr>
</tbody>
</table>

<hr>

<div class="org-center">
<p>
With that fossed, I hope your phone gets a new life and finally breathes alive!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
2023 - <b>Dilip<sup></sup></b>- Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
